import { Col, Row } from 'antd'
import React, { Component } from 'react'

export default class PrintReport extends Component {
    render() {
        return (
            <div
                style={{
                    padding: 40
                }}
            >
                <Row>
                    <Col
                        xs={12}
                    >
                        <div
                            style={{
                                textAlign: "center",
                                width: 300,
                                paddingTop: 20
                                // backgroundColor: "blue"
                            }}
                        >
                            <p>
                                <span className="HeaderFont">គណៈកម្មការអន្តរក្រសួង<br />
                                    ដើម្បីប្រយុទ្ធនឹងជំងឺកូវីដ១៩ (COVID-19)</span><br /><br />

                                អនុគណៈកម្មការស្រាវជ្រាវ និងតាមដានបុគ្គល<br />
                                សង្ស័យថាមានផ្ទុកជំងឺកូវីដ១៩ (COVID-19)<br />

                                ក្រុមការងារស្រាវជ្រាវតាមដានបុគ្គលសង្ស័យ<br />
                                ថាមានផ្ទុកជំងឺកូវីដ១៩ ខេត្ត ...................<br />
                                <span className="HeaderFont1"
                                    style={{
                                        fontSize: "300pt !important"
                                    }}
                                >3</span><br />

                                លេខ៖ ......................<br />
                            </p>
                        </div>
                    </Col>
                    <Col
                        xs={12}
                    >
                        <div
                            style={{
                                textAlign: "center",
                                width: 300,
                                float: 'right'
                                // backgroundColor: "blue"
                            }}
                        >
                            <p>
                                <span className="HeaderFont">ព្រះរាជាណាចក្រកម្ពុជា<br />
                                    ជាតិ សាសនា ព្រះមហាក្សត្រ

                                </span><br />

                                <span className="HeaderFont1"
                                    style={{
                                        fontSize: "300pt !important"
                                    }}
                                >3</span>
                            </p>
                        </div>
                    </Col>
                    <Col
                        xs={24}
                    >
                        <div
                            style={{
                                textAlign: "center"
                            }}
                        >
                            <p className="HeaderFont">
                                គោរពជូន<br />
                                ឯកឧត្តម ឧត្តមសេនីយ៍ឯក ឌី វិជ្ជា អគ្គស្នងការរង<br />
                                និងជាប្រធានអនុគណៈកម្មការស្រាវជ្រាវ និងតាមដានបុគ្គលសង្ស័យ<br />
                                ថាមានផ្ទុកជំងឺកូវីដ១៩ (Covid-19)

                            </p>
                        </div>
                    </Col>
                    <Col
                        xs={24}
                    >
                        <div
                            style={{
                                paddingTop: 10
                            }}
                        >
                            <table>
                                <tr>
                                    <td width="80" style={{ verticalAlign: "top" }}>
                                        <span className="HeaderFont">
                                            កម្មវត្ថុ៖
                                        </span>
                                    </td>
                                    <td>
                                        <p>
                                            របាយការណ៍ស្ដីពី លទ្ធផលការងារប្រចាំថ្ងៃទី០១ ខែមេសា ឆ្នាំ២០២១ (គិតចាប់ពី ម៉ោង០៧:០០នាទីព្រឹក  ថ្ងៃទី០១ មេសា ឆ្នាំ២០២១ ដល់ ម៉ោង០៧:០០នាទីព្រឹក ថ្ងៃទី០២ មេសា ឆ្នាំ២០២១)។
                                        </p>
                                    </td>
                                </tr>
                            </table>
                        </div>
                    </Col>
                    <Col
                        xs={24}
                    >
                        <div
                            style={{
                                paddingTop: 10
                            }}
                        >
                            <p>
                                &emsp;តមតាមកម្មវត្ថុខាងលើ ខ្ញុំបាទសូមគោរពរាយការណ៍ជូន <b>ឯកឧត្តម ឧត្តមសេនីយ៍ឯក ឌី វិជ្ជា
                                    អគ្គស្នងការរង និងជា ប្រធានអនុគណៈកម្មការស្រាវជ្រាវ និងតាមដានបុគ្គលសង្ស័យថាមានផ្ទុក
                                    ជំងឺកូវីដ១៩ (Covid-19)</b> មេត្តាជ្រាប អំពីលទ្ធផលការងារប្រចាំថ្ងៃមានដូចខាងក្រោម៖
                            </p>
                        </div>
                    </Col>
                    <Col
                        xs={24}
                    >
                        <div
                        // style={{
                        //     paddingTop: 10
                        // }}
                        >
                            <ul>
                                <li>
                                    <span className="HeaderFont">I. សភាពការណ៍ប្រចាំថ្ងៃ</span>
                                </li>
                                <ul>
                                    <li>
                                        <b>ក.ចំនួនអ្នកវិជ្ជមាន៖</b> អ្នកដែលមានផ្ទុកជំងឺកូវីដ១៩ ពាក់ព័ន្ធនឹងព្រឹត្តិការណ៍ ២០កុម្ភៈ សរុប ៦៣នាក់(ស្រី២៨នាក់) កើនថ្មី ០២នាក់ (ស្រី០១នាក់)
                                    </li>
                                    <ul style={{ listStyleType: "disc" }}>
                                        <li>
                                            ស្រុក............	៖........នាក់ 	ស្រី........នាក់	(ថ្មី.........នាក់ ស្រី.......នាក់)
                                        </li>
                                        <li>
                                            ស្រុក............	៖........នាក់ 	ស្រី........នាក់	(ថ្មី.........នាក់ ស្រី.......នាក់)
                                        </li>
                                        <li>
                                            ស្រុក............	៖........នាក់ 	ស្រី........នាក់	(ថ្មី.........នាក់ ស្រី.......នាក់)
                                        </li>
                                    </ul>
                                    <li>
                                        <b>ខ.អ្នកជាសះស្បើយ៖</b> ..........នាក់ (ស្រី.........នាក់) ថ្មី.........នាក់ (ស្រី........នាក់)
                                    </li>
                                    <li>
                                        <b>គ. អ្នកស្លាប់ចំនួន៖</b> ..........នាក់ (ស្រី.........នាក់) ថ្មី.........នាក់ (ស្រី........នាក់)
                                    </li>
                                    <li>
                                        <b>ឃ. អ្នកដែលផ្ទុកជំងឺកូវីដ១៩ មិនសហការ៖ </b> ..........នាក់ (ស្រី.........នាក់) ថ្មី.........នាក់ (ស្រី........នាក់)
                                    </li>
                                </ul>
                                <li>
                                    <span className="HeaderFont">II. ទីតាំងពាក់ព័ន្ធ</span>
                                </li>
                                <ul style={{ listStyleType: "disc" }}>
                                    <li>
                                        ទីតាំងដែលរកឃើញមានអ្នកពាក់ព័ន្ធសរុប	៖..............ទីតាំង	(ថ្មី ..........ទីតាំង)
                                    </li>
                                    <li>
                                        ទីតាំងមិនបានបិទការចេញចូល	៖..............ទីតាំង	(ថ្មី ..........ទីតាំង)
                                    </li>
                                    <li>
                                        ទីតាំងបិទការចេញចូលចំនួន	៖..............ទីតាំង	(ថ្មី...........ទីតាំង)
                                    </li>
                                    <li>
                                        ទីតាំងបើកការចេញចូលឡើងវិញចំនួន	៖..............ទីតាំង	(ថ្មី...........ទីតាំង)
                                    </li>
                                    <li>
                                        ទីតាំងមិនសហការ	៖..............ទីតាំង 	(ថ្មី...........ទីតាំង)
                                    </li>
                                </ul>
                                <li>
                                    <span className="HeaderFont">III. ការសម្ភាសន៍</span>
                                </li>
                                <ul>
                                    <li>
                                        <b>ក. លទ្ធផលសម្ភាសន៍អ្នកជំងឺសរុបចំនួន .....ករណី</b>
                                    </li>
                                    <ul style={{ listStyleType: "disc" }}>
                                        <li>
                                            ទំនាក់ទំនងអ្នកជំងឺបានចំនួន ........ករណី
                                        </li>
                                        <li>
                                            ជនជាតិខ្មែរចំនួន ......នាក់ ស្រី.....នាក់ (ករណីថ្មី .....នាក់)
                                        </li>
                                        <li>
                                            ជនជាតិចិនចំនួន ......នាក់ ស្រី ....នាក់ (ករណីថ្មី .....នាក់)
                                        </li>
                                    </ul>
                                    <li>
                                        <b>ខ.	លទ្ធផលសម្ភាសន៍អ្នកប៉ះពាល់</b>
                                    </li>
                                    <ul style={{ listStyleType: "disc" }}>
                                        <li>
                                            ធ្វើការសម្ភាសន៍ និងណែនាំអ្នកប៉ះពាល់ចំនួន ......នាក់ ស្រី.......នាក់
                                        </li>
                                    </ul>
                                    <li>
                                        <b>គ.	ទីតាំងប៉ះពាល់</b>
                                    </li>
                                    <ul style={{ listStyleType: "disc" }}>
                                        <li>
                                            រកឃើញទីតាំងប៉ះពាល់សរុប ......តាំង
                                        </li>
                                        <li>
                                            អាសយដ្ឋានច្បាស់លាស់ចំនួន .......ទីតាំង
                                        </li>
                                    </ul>
                                </ul>

                                <li style={{ marginTop: 100 }}>
                                    <span className="HeaderFont">IV. ក្រុមគ្រូពេទ្យ MOH និង RRT</span>
                                </li>
                                <ul style={{ listStyleType: "disc" }}>
                                    <li>
                                        ចុះយកសំណាក តាមទីតាំងចំនួន ..........ទីតាំង
                                    </li>
                                    <li>
                                        យកសំណាកសរុបចំនួន.........នាក់ ស្រី..........នាក់
                                    </li>
                                </ul>
                            </ul>
                        </div>
                    </Col>
                    <Col
                        xs={24}
                    >
                        <div
                            style={{
                                paddingTop: 10
                            }}
                        >
                            <p>
                                &emsp;អាស្រ័យដូចបានគោរពរាយការណ៍ជូនខាងលើ សូម <b>ឯកឧត្តម ឧត្តមសេនីយ៍ឯក ឌី វិជ្ជា
                                    អគ្គស្នងការរង និងជាប្រធានអនុគណៈកម្មការស្រាវជ្រាវ និងតាមដានបុគ្គលសង្ស័យថាមានផ្ទុកជំងឺកូវីដ១៩
                                    (Covid-19)</b> មេត្តាជ្រាបជារបាយការណ៍ដ៏ខ្ពង់ខ្ពស់។
                            </p>
                            <p>
                                &emsp;សូម <b>ឯកឧត្តម ឧត្តមសេនីយ៍ឯក</b> មេត្តាទទួលនូវការគោរពដ៏ខ្ពង់ខ្ពស់អំពីខ្ញុំ ។
                            </p>
                        </div>
                    </Col>
                    <Col
                        xs={24}
                    >
                        <div
                            style={{
                                textAlign: "center",
                                width: 300,
                                float: 'right'
                                // backgroundColor: "blue"
                            }}
                        >
                            ថ្ងៃ... ខែ...... ឆ្នាំជូត ទោស័ក ព.ស.២៥៦៤<br/>
                            រាជធានីភ្នំពេញ, ថ្ងៃទី... ខែ..... ឆ្នាំ២០២១<br/>
                            <b>អ្នកធ្វើរបាយការណ៍</b>

                        </div>
                    </Col>
                </Row>
            </div>
        )
    }
}
